Configuration/DataProcessors/ЛичныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЛичныйСчет</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Configuration/AccumulationRegisters/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>Сделки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВОбщественныйФонд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УчастникСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/AccumulationRegisters/кплРаспределениеСуммПоПроектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>кплРаспределениеСуммПоПроектам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчастникСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/DataProcessors/ЛичныйСчет/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура РаспределитьПоПроектамЗавершение(Результат,ДополнительныеПраметры) Экспорт
	ОбновитьСуммыНаФорме();	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределитьПоПроектам(Команда)
	ОткрытьФорму("ОбщаяФорма.кплФормаРаспределенияСредствПоПроектам",,,,,,
		Новый ОписаниеОповещения("РаспределитьПоПроектамЗавершение",ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьСуммыНаФорме()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапросПоРегистрам.УчастникСделки КАК УчастникСделки,
	               |	СУММА(ЗапросПоРегистрам.СуммаВОФ) КАК СуммаВОФ,
	               |	СУММА(ЗапросПоРегистрам.СуммаПоПроектам) КАК СуммаПоПроектам
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СделкиОбороты.УчастникСделки КАК УчастникСделки,
	               |		СделкиОбороты.СуммаВОбщественныйФондОборот КАК СуммаВОФ,
	               |		0 КАК СуммаПоПроектам
	               |	ИЗ
	               |		РегистрНакопления.Сделки.Обороты КАК СделкиОбороты
	               |	ГДЕ
	               |		СделкиОбороты.УчастникСделки = &УчастникСделки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		кплРаспределениеСуммПоПроектамОбороты.УчастникСделки,
	               |		0,
	               |		кплРаспределениеСуммПоПроектамОбороты.СуммаОборот
	               |	ИЗ
	               |		РегистрНакопления.кплРаспределениеСуммПоПроектам.Обороты(, , , ) КАК кплРаспределениеСуммПоПроектамОбороты
	               |	ГДЕ
	               |		кплРаспределениеСуммПоПроектамОбороты.УчастникСделки = &УчастникСделки) КАК ЗапросПоРегистрам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗапросПоРегистрам.УчастникСделки";
	
	Запрос.УстановитьПараметр("УчастникСделки",ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо );
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		СтрокаСумм = Результат.Выгрузить()[0];
		СуммаВОФ = СтрокаСумм.СуммаВОФ;
		СуммаРаспределить = СтрокаСумм.СуммаВОФ - СтрокаСумм.СуммаПоПроектам;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСуммыНаФорме();
КонецПроцедуры
